---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementStructuralTypeFilter
source: html/0968c555-4bfb-6c20-54a4-70901754dd56.htm
---
# ElementStructuralTypeFilter Members

Constructs a new instance of a filter to match elements by structural type.